WebContent/WEB-INF/aggregator/health_application/gmf/example.out.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hsl="http://HSL.OMS.Public.API.Service" xmlns="http://www.hambs.com.au/MemberServices/MemberServices.xsd"><soapenv:Header><wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext"><wsse:UsernameToken wsu:Id="Compare" xmlns:wsu="http://schemas.xmlsoap.org/ws/2003/06/utility"><wsse:Username>Compare</wsse:Username><wsse:Password Type="wsse:PasswordText">Gmfcompare</wsse:Password><wsu:Created>2012-11-15T00:00:00Z</wsu:Created></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><hsl:SubmitMembershipTransaction><hsl:xmlFile><![CDATA[<MembershipApplication><SubmittedBy>Agent</SubmittedBy><Persons><Person><PersonID>0</PersonID><EffDate>2012-11-15</EffDate><Relationship>Membr</Relationship><Title/><FirstName>Test</FirstName><Surname>Person</Surname><Gender>M</Gender><Birthdate>1961-01-01</Birthdate><MediCardNo>4297098813</MediCardNo><MediCardSubnumerate/><MediCardExpDate>092013</MediCardExpDate><MediCardFirstName>MediFirst</MediCardFirstName><MediCardSecondName>I</MediCardSecondName><MediCardSurname>MediLast</MediCardSurname><IsRebateApplicant>true</IsRebateApplicant><FullTimeStudent>false</FullTimeStudent><EmailAddress>test@person.com</EmailAddress><Transferring>true</Transferring><PreviousFund>AHM</PreviousFund><PreviousFundMemberNo>012345</PreviousFundMemberNo><IsMember>true</IsMember><JoinDate>2012-11-15</JoinDate></Person></Persons><Contacts><Addresses><Address><Code>H</Code><EffDate>2012-11-15</EffDate><Overseas>false</Overseas><Line1>9 9 SHERWOOD</Line1><Locality>TOOWONG</Locality><State>QLD</State><Postcode>4066</Postcode></Address><Address><Code>P</Code><EffDate>2012-11-15</EffDate><Overseas>false</Overseas><Line1>  </Line1><Locality/><State/><Postcode/></Address></Addresses><Phones><Phone><Code>H</Code><Number>0712341234</Number></Phone></Phones><EmailAddress>test@person.com</EmailAddress><CorrMethID>Mail</CorrMethID><IsSendEmail>false</IsSendEmail></Contacts><Cover><EffDate>2012-11-15</EffDate><Class>Fam</Class><CoverType/><ProductSelection/><AccountIgnored>false</AccountIgnored><BenefitPaymentMethod/><CoverRateSelection/></Cover><Contributions><DirectDebitContribPayments>true</DirectDebitContribPayments><EffDate>2012-11-15</EffDate><ContribFreq>Mthly</ContribFreq><Rebate>true</Rebate><RebateTier><EffDate>2012-11-15</EffDate><Tier>2</Tier><EligibleMedicare>true</EligibleMedicare><DebitOnDate>2012-10-25</DebitOnDate></RebateTier><Account><DebitCreditID>Bank</DebitCreditID><BSB/><AccountNumber/><AccountName/></Account></Contributions><Agency><AgencyID>INSERT BROKER ID HERE</AgencyID></Agency></MembershipApplication>]]></hsl:xmlFile></hsl:SubmitMembershipTransaction></soapenv:Body></soapenv:Envelope>